Revit 2027 API
BuiltInFailures.TrussFailures.TrussChordUntransformable Property
 Unable to maintain user changes to unpinned Chord. Restoring Truss-defined shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussChordUntransformable { get; }
Public Shared ReadOnly Property TrussChordUntransformable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussChordUntransformable {
	FailureDefinitionId^ get ();
}
static member TrussChordUntransformable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace